# SQL review
---------------------
Custom database created with fictional or random data for a potential technology store based in Donostia/San Sebastián.

In [4]:
import prettytable
prettytable.DEFAULT = prettytable.TableStyle

%load_ext sql
%sql sqlite:///TechDonostia.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql select email from proveedor;

 * sqlite:///TechDonostia.db
Done.

[('contacto@techdistribuidor.com',),
 ('info@gadgetssa.com',),
 ('ventas@electrohub.com',),
 ('contacto@mundogadget.com',)]

In [5]:
import pandas as pd
import sqlite3

db_path = '/content/drive/MyDrive/Telmo/love4pets.db'

# Crea una conexión a la base de datos SQLite
conn = sqlite3.connect(db_path)

# Escribe una consulta SQL para seleccionar todo el contenido de la tabla que deseas cargar
# Por ejemplo, si la tabla se llama 'pets'
query = 'SELECT * FROM proveedor'

# Usa pandas para cargar la consulta SQL directamente en un DataFrame
df = pd.read_sql_query(query, conn)

# Cierra la conexión a la base de datos
conn.close()

In [4]:
df

   proveedor_id              nombre                        email    telefono
0             1           Pets prov           petsprov@gmail.com   818853151
1             2             maxipet            maxipet@gmail.com  8650001508
2             3  adorables mascotas  adorablesmascotas@gmail.com  7150383416
3             4            huesitos           huesitos@gmail.com  6640163977

In [ ]:
data = {
    'Column1': [1, 2, 3],
    'Column2': ['A', 'B', 'C']
}
df = pd.DataFrame(data)

# Ruta a la base de datos SQLite
db_path = '/content/drive/MyDrive/Telmo/love4pets.db'

# Crear una conexión a la base de datos SQLite
conn = sqlite3.connect(db_path)

# Escribir los datos del DataFrame a una nueva tabla en la base de datos
# Si la tabla no existe, Pandas la creará automáticamente
df.to_sql('pruebaBorrar', conn, if_exists='append', index=False)

3

In [ ]:
db_path = '/content/drive/MyDrive/Telmo/love4pets.db'

# Crea una conexión a la base de datos SQLite
conn = sqlite3.connect(db_path)

# Escribe una consulta SQL para seleccionar todo el contenido de la tabla que deseas cargar
# Por ejemplo, si la tabla se llama 'pets'
query = 'SELECT * FROM pruebaBorrar'

# Usa pandas para cargar la consulta SQL directamente en un DataFrame
df = pd.read_sql_query(query, conn)

# Cierra la conexión a la base de datos
conn.close()
df

   Column1 Column2
0        1       A
1        2       B
2        3       C

Otras tablas existentes en **love4pets.db** son:  
* Empleado
* Cliente
* Mascota
* Producto
* Orden o Factura
* Detalle_orden
* Proveedor
* Suministro

In [27]:
from sqlalchemy import create_engine, inspect

# Crear una conexión a la base de datos
engine = create_engine('sqlite:///TechDonostia.db')

# Crear un inspector para examinar las tablas
inspector = inspect(engine)

# Obtener la lista de tablas
tables = inspector.get_table_names()

print("Tablas en la base de datos:")
for table in tables:
    print(table)

Tablas en la base de datos:
cliente
departamento
detalle_orden
empleado
equipo
orden
producto
proveedor
suministro

In [23]:
for cliente in session.query(Cliente).all():
    print(f'Cliente ID: {cliente.cliente_id}, Nombre: {cliente.nombre}, Email: {cliente.email}')

# Verificar contenido de la tabla Equipo
for equipo in session.query(Equipo).all():
    print(f'Equipo ID: {equipo.equipo_id}, Nombre: {equipo.nombre}, Tipo: {equipo.tipo}, Marca: {equipo.marca}')

Cliente ID: 1, Nombre: Ana Pérez, Email: ana.perez@example.com
Cliente ID: 2, Nombre: Carlos García, Email: carlos.garcia@example.com
Cliente ID: 3, Nombre: Laura Fernández, Email: laura.fernandez@example.com
Cliente ID: 4, Nombre: Manuel López, Email: manuel.lopez@example.com
Cliente ID: 5, Nombre: Isabel Romero, Email: isabel.romero@example.com
Cliente ID: 6, Nombre: Fernando Castro, Email: fernando.castro@example.com
Cliente ID: 7, Nombre: Sonia Ruiz, Email: sonia.ruiz@example.com
Cliente ID: 8, Nombre: Daniel Gómez, Email: daniel.gomez@example.com
Cliente ID: 9, Nombre: Cristina Hernández, Email: cristina.hernandez@example.com
Cliente ID: 10, Nombre: Roberto Martínez, Email: roberto.martinez@example.com
Cliente ID: 11, Nombre: Patricia Jiménez, Email: patricia.jimenez@example.com
Cliente ID: 12, Nombre: Miguel Ángel López, Email: miguel.angel.lopez@example.com
Cliente ID: 13, Nombre: Beatriz Pérez, Email: beatriz.perez@example.com
Cliente ID: 14, Nombre: Jorge Torres, Email: jorge.torres@example.com
Cliente ID: 15, Nombre: Victor Ramos, Email: victor.ramos@example.com
Cliente ID: 16, Nombre: Ana Belén Ruiz, Email: ana.belen.ruiz@example.com
Cliente ID: 17, Nombre: Raquel Moreno, Email: raquel.moreno@example.com
Cliente ID: 18, Nombre: David Márquez, Email: david.marquez@example.com
Cliente ID: 19, Nombre: Elena Gil, Email: elena.gil@example.com
Cliente ID: 20, Nombre: Carlos Medina, Email: carlos.medina@example.com
Cliente ID: 21, Nombre: Silvia Navarro, Email: silvia.navarro@example.com
Cliente ID: 22, Nombre: Andrés Ortega, Email: andres.ortega@example.com
Cliente ID: 23, Nombre: Laura Fernández, Email: laura.fernandez@example.com
Cliente ID: 24, Nombre: Manuel López, Email: manuel.lopez@example.com
Cliente ID: 25, Nombre: Isabel Romero, Email: isabel.romero@example.com
Equipo ID: 1, Nombre: Laptop HP Spectre, Tipo: Portátil, Marca: HP
Equipo ID: 2, Nombre: Samsung Galaxy Tab, Tipo: Tablet, Marca: Samsung
Equipo ID: 3, Nombre: MacBook Air, Tipo: Portátil, Marca: Apple
Equipo ID: 4, Nombre: Huawei MatePad, Tipo: Tablet, Marca: Huawei
Equipo ID: 5, Nombre: HP Envy, Tipo: Portátil, Marca: HP
Equipo ID: 6, Nombre: Dell Inspiron, Tipo: Portátil, Marca: Dell
Equipo ID: 7, Nombre: Asus ZenBook, Tipo: Portátil, Marca: Asus
Equipo ID: 8, Nombre: iPad Mini, Tipo: Tablet, Marca: Apple
Equipo ID: 9, Nombre: Samsung Galaxy Book, Tipo: Portátil, Marca: Samsung
Equipo ID: 10, Nombre: Lenovo Yoga, Tipo: Portátil, Marca: Lenovo
Equipo ID: 11, Nombre: Microsoft Surface Laptop, Tipo: Portátil, Marca: Microsoft
Equipo ID: 12, Nombre: Acer Swift, Tipo: Portátil, Marca: Acer
Equipo ID: 13, Nombre: Google Pixel Slate, Tipo: Tablet, Marca: Google
Equipo ID: 14, Nombre: Razer Blade Stealth, Tipo: Portátil, Marca: Razer
Equipo ID: 15, Nombre: Huawei P30 Pro, Tipo: Teléfono, Marca: Huawei
Equipo ID: 16, Nombre: Xiaomi Mi Pad 4, Tipo: Tablet, Marca: Xiaomi
Equipo ID: 17, Nombre: LG Gram, Tipo: Portátil, Marca: LG
Equipo ID: 18, Nombre: MacBook Air, Tipo: Portátil, Marca: Apple
Equipo ID: 19, Nombre: Huawei MatePad, Tipo: Tablet, Marca: Huawei
Equipo ID: 20, Nombre: HP Envy, Tipo: Portátil, Marca: HP

In [15]:
print('select * FROM suministro')
%sql select * FROM suministro

select * FROM suministro
 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(3, 1, 30, '2015-01-01 00:00:000'),
 (3, 2, 10, '2015-01-01 00:00:000'),
 (2, 3, 5, '2015-01-01 00:00:000'),
 (2, 4, 5, '2015-01-01 00:00:000'),
 (1, 5, 5, '2015-01-01 00:00:000'),
 (4, 6, 5, '2015-01-01 00:00:000')]

In [16]:
from sqlalchemy import create_engine, Column, Integer, String, Float, ForeignKey, DateTime
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import relationship, sessionmaker
from datetime import datetime

Base = declarative_base()

class Cliente(Base):
    __tablename__ = 'cliente'
    cliente_id = Column(Integer, primary_key=True)
    nombre = Column(String)
    email = Column(String)
    telefono = Column(String)
    contacto = Column(String)
    telefono_contacto = Column(String)
    ciudad = Column(String)

class Departamento(Base):
    __tablename__ = 'departamento'
    departamento_id = Column(Integer, primary_key=True)
    nombre = Column(String)

class Empleado(Base):
    __tablename__ = 'empleado'
    empleado_id = Column(Integer, primary_key=True)
    nombre = Column(String)
    email = Column(String)
    telefono = Column(String)
    salario = Column(Float)
    fecha_ingreso = Column(DateTime)
    departamento_id = Column(Integer, ForeignKey('departamento.departamento_id'))
    departamento = relationship("Departamento")

class Equipo(Base):
    __tablename__ = 'equipo'
    equipo_id = Column(Integer, primary_key=True)
    nombre = Column(String)
    cliente_id = Column(Integer, ForeignKey('cliente.cliente_id'))
    tipo = Column(String)
    marca = Column(String)
    fecha_adquisicion = Column(DateTime)
    cliente = relationship("Cliente")

class Orden(Base):
    __tablename__ = 'orden'
    orden_id = Column(Integer, primary_key=True)
    cliente_id = Column(Integer, ForeignKey('cliente.cliente_id'))
    fecha = Column(DateTime)
    cliente = relationship("Cliente")

class DetalleOrden(Base):
    __tablename__ = 'detalle_orden'
    detalle_id = Column(Integer, primary_key=True)
    orden_id = Column(Integer, ForeignKey('orden.orden_id'))
    producto_id = Column(Integer, ForeignKey('producto.producto_id'))
    cantidad = Column(Integer)
    precio = Column(Float)
    orden = relationship("Orden")
    producto = relationship("Producto")

class Producto(Base):
    __tablename__ = 'producto'
    producto_id = Column(Integer, primary_key=True)
    nombre = Column(String)
    descripcion = Column(String)
    precio = Column(Float)

class Proveedor(Base):
    __tablename__ = 'proveedor'
    proveedor_id = Column(Integer, primary_key=True)
    nombre = Column(String)
    email = Column(String)
    telefono = Column(String)

class Suministro(Base):
    __tablename__ = 'suministro'
    proveedor_id = Column(Integer, ForeignKey('proveedor.proveedor_id'), primary_key=True)
    producto_id = Column(Integer, ForeignKey('producto.producto_id'), primary_key=True)
    cantidad = Column(Integer)
    fecha = Column(DateTime)
    proveedor = relationship("Proveedor")
    producto = relationship("Producto")

In [17]:
engine = create_engine('sqlite:///TechDonostia.db')

# Crear todas las tablas en la base de datos
Base.metadata.create_all(engine)

# Crear una sesión
Session = sessionmaker(bind=engine)
session = Session()

In [18]:
# Insertar datos en la tabla Departamento
departamentos = [
    Departamento(nombre='Ventas'),
    Departamento(nombre='Soporte Técnico'),
    Departamento(nombre='Recursos Humanos'),
    Departamento(nombre='Desarrollo'),
    Departamento(nombre='Logística'),
    Departamento(nombre='Finanzas')
]
session.add_all(departamentos)
session.commit()

# Insertar datos en la tabla Cliente
clientes = [
    Cliente(nombre='Ana Pérez', email='ana.perez@example.com', telefono='123-456-789', contacto='Juan López', telefono_contacto='987-654-321', ciudad='Madrid'),
    Cliente(nombre='Carlos García', email='carlos.garcia@example.com', telefono='234-567-890', contacto='Marta Ruiz', telefono_contacto='876-543-210', ciudad='Barcelona')
    # Agrega más clientes si lo deseas
]
session.add_all(clientes)
session.commit()

# Insertar datos en la tabla Empleado
empleados = [
    Empleado(nombre='Luis Martínez', email='luis.martinez@example.com', telefono='345-678-901', salario=2000, fecha_ingreso=datetime(2019, 5, 17), departamento_id=1),
    Empleado(nombre='María Sánchez', email='maria.sanchez@example.com', telefono='456-789-012', salario=2200, fecha_ingreso=datetime(2020, 6, 1), departamento_id=2)
    # Agrega más empleados si lo deseas
]
session.add_all(empleados)
session.commit()

# Insertar datos en la tabla Producto
productos = [
    Producto(nombre='Portátil Dell XPS 13', descripcion='Portátil ultradelgado con pantalla de 13 pulgadas', precio=1200),
    Producto(nombre='iPhone 13', descripcion='Teléfono inteligente de última generación', precio=999),
    Producto(nombre='iPad Pro', descripcion='Tablet con pantalla de 12.9 pulgadas', precio=1100)
    # Agrega más productos si lo deseas
]
session.add_all(productos)
session.commit()

# Insertar datos en la tabla Orden
ordenes = [
    Orden(cliente_id=1, fecha=datetime(2022, 1, 15)),
    Orden(cliente_id=2, fecha=datetime(2022, 2, 20))
    # Agrega más órdenes si lo deseas
]
session.add_all(ordenes)
session.commit()

# Insertar datos en la tabla DetalleOrden
detalle_ordenes = [
    DetalleOrden(orden_id=1, producto_id=1, cantidad=1, precio=1200),
    DetalleOrden(orden_id=1, producto_id=2, cantidad=1, precio=999),
    DetalleOrden(orden_id=2, producto_id=3, cantidad=2, precio=1100)
    # Agrega más detalles de órdenes si lo deseas
]
session.add_all(detalle_ordenes)
session.commit()

# Insertar datos en la tabla Proveedor
proveedores = [
    Proveedor(nombre='TechDistribuidor', email='contacto@techdistribuidor.com', telefono='567-890-123'),
    Proveedor(nombre='Gadgets S.A.', email='info@gadgetssa.com', telefono='678-901-234')
    # Agrega más proveedores si lo deseas
]
session.add_all(proveedores)
session.commit()

# Insertar datos en la tabla Suministro
suministros = [
    Suministro(proveedor_id=1, producto_id=1, cantidad=50, fecha=datetime(2024, 1, 1)),
    Suministro(proveedor_id=2, producto_id=2, cantidad=30, fecha=datetime(2024, 1, 1))
    # Agrega más suministros si lo deseas
]
session.add_all(suministros)
session.commit()

# Insertar datos en la tabla Equipo (análogo a 'mascota')
equipos = [
    Equipo(nombre='Laptop HP Spectre', cliente_id=1, tipo='Portátil', marca='HP', fecha_adquisicion=datetime(2022, 5, 10)),
    Equipo(nombre='Samsung Galaxy Tab', cliente_id=2, tipo='Tablet', marca='Samsung', fecha_adquisicion=datetime(2021, 7, 23))
    # Agrega más equipos si lo deseas
]
session.add_all(equipos)
session.commit()

In [19]:
# Insertar más datos en la tabla Cliente
clientes.extend([
    Cliente(nombre='Laura Fernández', email='laura.fernandez@example.com', telefono='456-123-789', contacto='Pedro Gómez', telefono_contacto='654-321-987', ciudad='Valencia'),
    Cliente(nombre='Manuel López', email='manuel.lopez@example.com', telefono='789-456-123', contacto='Sofía Torres', telefono_contacto='321-654-987', ciudad='Sevilla'),
    Cliente(nombre='Isabel Romero', email='isabel.romero@example.com', telefono='321-654-987', contacto='Miguel Ángel', telefono_contacto='123-987-654', ciudad='Bilbao'),
    Cliente(nombre='Fernando Castro', email='fernando.castro@example.com', telefono='234-567-890', contacto='Laura Pérez', telefono_contacto='876-543-210', ciudad='Málaga'),
    Cliente(nombre='Sonia Ruiz', email='sonia.ruiz@example.com', telefono='345-678-901', contacto='Ana López', telefono_contacto='987-654-321', ciudad='Zaragoza'),
    Cliente(nombre='Daniel Gómez', email='daniel.gomez@example.com', telefono='456-789-012', contacto='Carlos Sánchez', telefono_contacto='678-901-234', ciudad='Murcia'),
    Cliente(nombre='Cristina Hernández', email='cristina.hernandez@example.com', telefono='567-890-123', contacto='Marcos Rodríguez', telefono_contacto='789-012-345', ciudad='Granada'),
    Cliente(nombre='Roberto Martínez', email='roberto.martinez@example.com', telefono='678-901-234', contacto='Elena García', telefono_contacto='890-123-456', ciudad='Alicante'),
    Cliente(nombre='Patricia Jiménez', email='patricia.jimenez@example.com', telefono='789-012-345', contacto='Sergio Fernández', telefono_contacto='901-234-567', ciudad='Valladolid'),
    Cliente(nombre='Miguel Ángel López', email='miguel.angel.lopez@example.com', telefono='890-123-456', contacto='Laura Sánchez', telefono_contacto='012-345-678', ciudad='Vigo'),
    Cliente(nombre='Beatriz Pérez', email='beatriz.perez@example.com', telefono='901-234-567', contacto='Luis García', telefono_contacto='123-456-789', ciudad='Santander'),
    Cliente(nombre='Jorge Torres', email='jorge.torres@example.com', telefono='012-345-678', contacto='Pablo Martín', telefono_contacto='234-567-890', ciudad='Cádiz'),
    Cliente(nombre='Victor Ramos', email='victor.ramos@example.com', telefono='123-456-789', contacto='Lucía Gómez', telefono_contacto='345-678-901', ciudad='San Sebastián'),
    Cliente(nombre='Ana Belén Ruiz', email='ana.belen.ruiz@example.com', telefono='234-567-890', contacto='David Jiménez', telefono_contacto='456-789-012', ciudad='Pamplona'),
    Cliente(nombre='Raquel Moreno', email='raquel.moreno@example.com', telefono='345-678-901', contacto='María Fernández', telefono_contacto='567-890-123', ciudad='Badajoz'),
    Cliente(nombre='David Márquez', email='david.marquez@example.com', telefono='456-789-012', contacto='Marta López', telefono_contacto='678-901-234', ciudad='León'),
    Cliente(nombre='Elena Gil', email='elena.gil@example.com', telefono='567-890-123', contacto='Javier Hernández', telefono_contacto='789-012-345', ciudad='Logroño'),
    Cliente(nombre='Carlos Medina', email='carlos.medina@example.com', telefono='678-901-234', contacto='Andrea Morales', telefono_contacto='890-123-456', ciudad='Burgos'),
    Cliente(nombre='Silvia Navarro', email='silvia.navarro@example.com', telefono='789-012-345', contacto='Antonio Torres', telefono_contacto='901-234-567', ciudad='Albacete'),
    Cliente(nombre='Andrés Ortega', email='andres.ortega@example.com', telefono='890-123-456', contacto='Patricia Díaz', telefono_contacto='012-345-678', ciudad='Salamanca')
])
session.add_all(clientes)
session.commit()

# Insertar más datos en la tabla Equipo (análogo a 'mascota')
equipos.extend([
    Equipo(nombre='MacBook Air', cliente_id=3, tipo='Portátil', marca='Apple', fecha_adquisicion=datetime(2023, 1, 10)),
    Equipo(nombre='Huawei MatePad', cliente_id=4, tipo='Tablet', marca='Huawei', fecha_adquisicion=datetime(2022, 8, 15)),
    Equipo(nombre='HP Envy', cliente_id=5, tipo='Portátil', marca='HP', fecha_adquisicion=datetime(2023, 3, 5)),
    Equipo(nombre='Dell Inspiron', cliente_id=6, tipo='Portátil', marca='Dell', fecha_adquisicion=datetime(2021, 2, 20)),
    Equipo(nombre='Asus ZenBook', cliente_id=7, tipo='Portátil', marca='Asus', fecha_adquisicion=datetime(2022, 9, 12)),
    Equipo(nombre='iPad Mini', cliente_id=8, tipo='Tablet', marca='Apple', fecha_adquisicion=datetime(2021, 11, 25)),
    Equipo(nombre='Samsung Galaxy Book', cliente_id=9, tipo='Portátil', marca='Samsung', fecha_adquisicion=datetime(2023, 6, 30)),
    Equipo(nombre='Lenovo Yoga', cliente_id=10, tipo='Portátil', marca='Lenovo', fecha_adquisicion=datetime(2023, 4, 10)),
    Equipo(nombre='Microsoft Surface Laptop', cliente_id=11, tipo='Portátil', marca='Microsoft', fecha_adquisicion=datetime(2022, 3, 8)),
    Equipo(nombre='Acer Swift', cliente_id=12, tipo='Portátil', marca='Acer', fecha_adquisicion=datetime(2021, 5, 14)),
    Equipo(nombre='Google Pixel Slate', cliente_id=13, tipo='Tablet', marca='Google', fecha_adquisicion=datetime(2022, 12, 1)),
    Equipo(nombre='Razer Blade Stealth', cliente_id=14, tipo='Portátil', marca='Razer', fecha_adquisicion=datetime(2023, 7, 9)),
    Equipo(nombre='Huawei P30 Pro', cliente_id=15, tipo='Teléfono', marca='Huawei', fecha_adquisicion=datetime(2021, 8, 15)),
    Equipo(nombre='Xiaomi Mi Pad 4', cliente_id=16, tipo='Tablet', marca='Xiaomi', fecha_adquisicion=datetime(2022, 10, 18)),
    Equipo(nombre='LG Gram', cliente_id=17, tipo='Portátil', marca='LG', fecha_adquisicion=datetime(2023, 11, 20))
])
session.add_all(equipos)
session.commit()

In [20]:
clientes.extend([
    Cliente(nombre='Laura Fernández', email='laura.fernandez@example.com', telefono='456-123-789', contacto='Pedro Gómez', telefono_contacto='654-321-987', ciudad='Valencia'),
    Cliente(nombre='Manuel López', email='manuel.lopez@example.com', telefono='789-456-123', contacto='Sofía Torres', telefono_contacto='321-654-987', ciudad='Sevilla'),
    Cliente(nombre='Isabel Romero', email='isabel.romero@example.com', telefono='321-654-987', contacto='Miguel Ángel', telefono_contacto='123-987-654', ciudad='Bilbao')
])
session.add_all(clientes)
session.commit()

# Insertar más datos en la tabla Empleado
empleados.extend([
    Empleado(nombre='Javier Morales', email='javier.morales@example.com', telefono='567-890-234', salario=2500, fecha_ingreso=datetime(2018, 4, 10), departamento_id=3),
    Empleado(nombre='Sara Díaz', email='sara.diaz@example.com', telefono='678-901-345', salario=2100, fecha_ingreso=datetime(2019, 7, 22), departamento_id=4),
    Empleado(nombre='Pedro Jiménez', email='pedro.jimenez@example.com', telefono='789-012-456', salario=2300, fecha_ingreso=datetime(2021, 3, 15), departamento_id=5),
    Empleado(nombre='Elena Navarro', email='elena.navarro@example.com', telefono='890-123-567', salario=2400, fecha_ingreso=datetime(2020, 11, 5), departamento_id=6)
])
session.add_all(empleados)
session.commit()

# Insertar más datos en la tabla Producto
productos.extend([
    Producto(nombre='MacBook Pro', descripcion='Portátil de alto rendimiento con pantalla de 16 pulgadas', precio=2500),
    Producto(nombre='Samsung Galaxy S21', descripcion='Teléfono inteligente con cámara de alta resolución', precio=799),
    Producto(nombre='Microsoft Surface Pro', descripcion='Tablet y portátil convertible con pantalla táctil', precio=1200),
    Producto(nombre='Lenovo ThinkPad X1 Carbon', descripcion='Portátil ligero con durabilidad extrema', precio=1500)
])
session.add_all(productos)
session.commit()

# Insertar más datos en la tabla Orden
ordenes.extend([
    Orden(cliente_id=3, fecha=datetime(2022, 3, 25)),
    Orden(cliente_id=4, fecha=datetime(2022, 4, 30)),
    Orden(cliente_id=5, fecha=datetime(2022, 5, 12))
])
session.add_all(ordenes)
session.commit()

# Insertar más datos en la tabla DetalleOrden
detalle_ordenes.extend([
    DetalleOrden(orden_id=3, producto_id=4, cantidad=1, precio=2500),
    DetalleOrden(orden_id=3, producto_id=5, cantidad=1, precio=799),
    DetalleOrden(orden_id=4, producto_id=6, cantidad=1, precio=1200),
    DetalleOrden(orden_id=5, producto_id=7, cantidad=1, precio=1500)
])
session.add_all(detalle_ordenes)
session.commit()

# Insertar más datos en la tabla Proveedor
proveedores.extend([
    Proveedor(nombre='ElectroHub', email='ventas@electrohub.com', telefono='890-234-567'),
    Proveedor(nombre='MundoGadget', email='contacto@mundogadget.com', telefono='901-345-678')
])
session.add_all(proveedores)
session.commit()

# Insertar más datos en la tabla Suministro
suministros.extend([
    Suministro(proveedor_id=3, producto_id=4, cantidad=40, fecha=datetime(2024, 1, 15)),
    Suministro(proveedor_id=4, producto_id=5, cantidad=25, fecha=datetime(2024, 2, 10)),
    Suministro(proveedor_id=1, producto_id=6, cantidad=30, fecha=datetime(2024, 3, 5)),
    Suministro(proveedor_id=2, producto_id=7, cantidad=20, fecha=datetime(2024, 4, 20))
])
session.add_all(suministros)
session.commit()

# Insertar más datos en la tabla Equipo (análogo a 'mascota')
equipos.extend([
    Equipo(nombre='MacBook Air', cliente_id=3, tipo='Portátil', marca='Apple', fecha_adquisicion=datetime(2023, 1, 10)),
    Equipo(nombre='Huawei MatePad', cliente_id=4, tipo='Tablet', marca='Huawei', fecha_adquisicion=datetime(2022, 8, 15)),
    Equipo(nombre='HP Envy', cliente_id=5, tipo='Portátil', marca='HP', fecha_adquisicion=datetime(2023, 3, 5))
])
session.add_all(equipos)
session.commit()

Consultas básicas de selección
--------
La sintaxis básica de una consulta de selección es la siguiente:

```sql
select Campo FROM Tabla;
```
Pero para hacer esa consulta debemos conocer el nombre del campo que queremos consultar. Podemos mostrar el "schema" o diseño de la tabla con la instrucción **PRAGMA table_info(Tabla);**

In [ ]:
%sql PRAGMA table_info(empleado);

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(0, 'empleado_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 0, None, 0),
 (4, 'salario', 'INTEGER', 1, None, 0),
 (5, 'fecha_ingreso', 'DATETIME', 1, 'CURRENT_DATE', 0),
 (6, 'departamento_id', 'INTEGER', 0, None, 0)]

Podemos observar que la Tabla **empleado** contiene los campos:
* empleado_id
* nombre
* email
* telefono
* salario
* fecha_ingreso
* departamento_id

Veamos ahora un ejemplo de selección a alguno de estos campos:

In [ ]:
%sql select nombre FROM empleado;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Andres Riera Herrera',),
 ('Lucas Serrano Caballero',),
 ('Pablo Pons Sanz',),
 ('Saul Moreno Santos',),
 ('Nil Soler Diez',),
 ('Sergio Reyes Gallardo',),
 ('Isaac Jimenez Ortiz',),
 ('Guillermo Vidal Gomez',),
 ('Daniel Quintero Quintero',),
 ('Juan Manuel Olivares',),
 ('Miguel Soto',),
 ('Alejandro Fernandez',)]

Podemos agregar mas campos a mostrar en una misma consulta al separar los campos por comas(,) por ejemplo:

In [ ]:
%sql select nombre, telefono FROM empleado;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Andres Riera Herrera', '200-88-76'),
 ('Lucas Serrano Caballero', '115-24-36'),
 ('Pablo Pons Sanz', '748-72-75'),
 ('Saul Moreno Santos', '346-87-27'),
 ('Nil Soler Diez', '576-84-28'),
 ('Sergio Reyes Gallardo', '598-95-67'),
 ('Isaac Jimenez Ortiz', '370-19-65'),
 ('Guillermo Vidal Gomez', '099-05-68'),
 ('Daniel Quintero Quintero', '261-97-06'),
 ('Juan Manuel Olivares', '269-37-06'),
 ('Miguel Soto', '269-92-06'),
 ('Alejandro Fernandez', '119-91-16')]

Tambien es posible solicitar todos los campos de una tabla con el signo asterisco(*):

In [ ]:
%sql select * FROM empleado;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(1, 'Andres Riera Herrera', 'andresr@gmail.com', '200-88-76', 1500, '2017-05-17 00:00:000', 6),
 (2, 'Lucas Serrano Caballero', 'lucas99@gmail.com', '115-24-36', 1200, '2018-05-17 00:00:000', 2),
 (3, 'Pablo Pons Sanz', 'ppsanz@gmail.com', '748-72-75', 1350, '2016-07-01 00:00:000', 1),
 (4, 'Saul Moreno Santos', 'saul.morenosantos@gmail.com', '346-87-27', 1600, '2016-07-01 00:00:000', 1),
 (5, 'Nil Soler Diez', 'nilsoler@gmail.com', '576-84-28', 1100, '2016-04-03 00:00:000', 5),
 (6, 'Sergio Reyes Gallardo', 'zerg@gmail.com', '598-95-67', 1000, '2016-04-03 00:00:000', 5),
 (7, 'Isaac Jimenez Ortiz', 'isaacortiz@gmail.com', '370-19-65', 1600, '2016-07-08 00:00:000', 3),
 (8, 'Guillermo Vidal Gomez', 'guillevidal@gmail.com', '099-05-68', 1400, '2016-01-03 00:00:000', 3),
 (9, 'Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06', 1500, '2017-03-05 00:00:000', 6),
 (10, 'Juan Manuel Olivares', 'juanma@gmail.com', '269-37-06', 1500, '2017-03-05 00:00:000', None),
 (11, 'Miguel Soto', 'misoto@gmail.com', '269-92-06', 1900, '2017-03-05 00:00:000', 6),
 (12, 'Alejandro Fernandez', 'alefer@gmail.com', '119-91-16', 1850, '2017-03-05 00:00:000', 6)]

### **Ejercicio 1**
--------
Complete el siguiente código para obtener un listado de los nombres, telefonos, y el correo electrónico de todos los clientes y asi contactarlos para notificarles de una promoción.

In [ ]:
%sql PRAGMA table_info(cliente);

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(0, 'cliente_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 1, None, 0),
 (4, 'contacto', 'TEXT', 0, None, 0),
 (5, 'telefono_contacto', 'TEXT', 0, None, 0),
 (6, 'ciudad', 'TEXT', 1, None, 0)]

In [ ]:
%sql select cliente.nombre, cliente.telefono, cliente.email from cliente

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Mario Flores Gallardo', '036-15-36', 'marioflores@gmail.com'),
 ('Arnau Medina Garcia', '094-10-88', 'arnaumedina@gmail.com'),
 ('Ivan Medina Rubio', '083-08-72', 'ivanmedina@gmail.com'),
 ('Jan Vargas Santana', '780-65-24', 'vargasjan@gmail.com'),
 ('Carlos Costa Guerrero', '180-65-24', 'carloscostag@gmail.com'),
 ('Roberto Martin Ortega', '742-63-27', 'robertmartin@gmail.com'),
 ('Gabriel Gonzalez Ortega', '780-13-14', 'gabogonzo@gmail.com'),
 ('Rayan Leon Ferrer', '430-65-24', 'rayito@gmail.com'),
 ('Aitor Ruiz Sanchez', '780-77-24', 'aitorsanchez@gmail.com'),
 ('Eric Rubio Carrasco', '780-65-79', 'ericrubio@gmail.com'),
 ('Alberto Sanz Ruiz', '781-15-24', 'albert@gmail.com'),
 ('Jesus Medina Hernandez', '782-35-25', 'jmedinah@gmail.com'),
 ('Pol Moya Pena', '780-25-24', 'polmoya@gmail.com'),
 ('Jose Gallardo Rodriguez', '783-65-11', 'josegallardo@gmail.com'),
 ('Manuel Angel Gil', '733-65-16', 'manano@gmail.com')]

### Ordenar los registros, ORDER BY
--------
Es posible especificar el orden en que queremos que se muestre resultado de una consulta, esto se consigue con la clausula **ORDER BY**
```sql
select campo1,campo2,...,campoN FROM Tabla ORDER BY campoX;
```
Veamos un ejemplo sobre la tabla empleado:

**Liste los empleados de Love4Pets ordenados por su salario**

In [ ]:
%sql select empleado.nombre, empleado.salario from empleado order by salario;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Sergio Reyes Gallardo', 1000),
 ('Nil Soler Diez', 1100),
 ('Lucas Serrano Caballero', 1200),
 ('Pablo Pons Sanz', 1350),
 ('Guillermo Vidal Gomez', 1400),
 ('Andres Riera Herrera', 1500),
 ('Daniel Quintero Quintero', 1500),
 ('Juan Manuel Olivares', 1500),
 ('Saul Moreno Santos', 1600),
 ('Isaac Jimenez Ortiz', 1600),
 ('Alejandro Fernandez', 1850),
 ('Miguel Soto', 1900)]

Se puede ordenar el resultado por mas de un campo, por ejemplo podemos ordenar los empleados segun su sueldo usando el campo **salario** y además en orden alfabetico por el campo **nombre**

In [ ]:
%sql select nombre, salario FROM empleado ORDER BY salario, nombre;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Sergio Reyes Gallardo', 1000),
 ('Nil Soler Diez', 1100),
 ('Lucas Serrano Caballero', 1200),
 ('Pablo Pons Sanz', 1350),
 ('Guillermo Vidal Gomez', 1400),
 ('Andres Riera Herrera', 1500),
 ('Daniel Quintero Quintero', 1500),
 ('Juan Manuel Olivares', 1500),
 ('Isaac Jimenez Ortiz', 1600),
 ('Saul Moreno Santos', 1600),
 ('Alejandro Fernandez', 1850),
 ('Miguel Soto', 1900)]

Además puede usarse el ordenar por campos de forma independiente, de forma ASCENDENTE mediante la clausula **ASC** y DESCENDENTE mediante la clausula **DESC**

In [ ]:
%sql select nombre, salario FROM empleado ORDER BY salario DESC, nombre ASC;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Miguel Soto', 1900),
 ('Alejandro Fernandez', 1850),
 ('Isaac Jimenez Ortiz', 1600),
 ('Saul Moreno Santos', 1600),
 ('Andres Riera Herrera', 1500),
 ('Daniel Quintero Quintero', 1500),
 ('Juan Manuel Olivares', 1500),
 ('Guillermo Vidal Gomez', 1400),
 ('Pablo Pons Sanz', 1350),
 ('Lucas Serrano Caballero', 1200),
 ('Nil Soler Diez', 1100),
 ('Sergio Reyes Gallardo', 1000)]

La instrucción  **Limit** reduce la cantidad de filas de salida en el resultado al número indicado.
Cuando usamos la instrucción LIMIT junto con el ORDER BY estamos tomando alguno de los extremos de la consulta, por ejemplo los 3 sueldos mas altos, o los 5 sueldos mas bajos.

Veamos un par de ejemplos de esto:

In [ ]:
%sql select nombre, salario FROM empleado ORDER BY salario DESC, nombre ASC LIMIT 5;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Miguel Soto', 1900),
 ('Alejandro Fernandez', 1850),
 ('Isaac Jimenez Ortiz', 1600),
 ('Saul Moreno Santos', 1600),
 ('Andres Riera Herrera', 1500)]

In [ ]:
%sql select nombre,salario FROM empleado ORDER BY salario ASC LIMIT 5;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Sergio Reyes Gallardo', 1000),
 ('Nil Soler Diez', 1100),
 ('Lucas Serrano Caballero', 1200),
 ('Pablo Pons Sanz', 1350),
 ('Guillermo Vidal Gomez', 1400)]

### Filtro sobre operación de selección, DISTINCT
------
La Instrucción DISTINCT omite en el resultado los campos que son iguales.

Veamos un ejemplos:

In [ ]:
%sql select DISTINCT salario, nombre  FROM empleado ORDER BY salario DESC;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1900, 'Miguel Soto'),
 (1850, 'Alejandro Fernandez'),
 (1600, 'Saul Moreno Santos'),
 (1600, 'Isaac Jimenez Ortiz'),
 (1500, 'Andres Riera Herrera'),
 (1500, 'Daniel Quintero Quintero'),
 (1500, 'Juan Manuel Olivares'),
 (1400, 'Guillermo Vidal Gomez'),
 (1350, 'Pablo Pons Sanz'),
 (1200, 'Lucas Serrano Caballero'),
 (1100, 'Nil Soler Diez'),
 (1000, 'Sergio Reyes Gallardo')]

En el ejemplo anterior se muestran solamente los diferentes salarios, aún cuando 2 empleados tienen un sueldo de 1600 y otros 2 de 1500

### La Clausula **WHERE**
Se usa para indicar que se limita la selección a los campos que cumplan una determinada condición.

```sql
select campo1,campo2,...,campoN FROM Tabla WHERE condición;
```

#### Operadores usados en la clausula WHERE
| Operador |  Descripción |
|----------|--------------|
| = |  igualdad |
| <> |  Distinto uno de otro |
| > |  Mayor que |
| < |  Menor que |
| =< |  Mayor o igual que |
| <= |  Menor o igual que |
| Between |  Entre un cierto rango |
| LIKE |  Cumple una estructura dada |
| IN |  Permite comparar con multiples valores |

Veamos algunos ejemplos de la clausula WHERE:

In [ ]:
%sql select nombre, salario FROM empleado WHERE salario>1500 ORDER BY salario DESC LIMIT 2;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Miguel Soto', 1900), ('Alejandro Fernandez', 1850)]

In [ ]:
%sql select nombre, salario FROM empleado WHERE salario = 1350;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Pablo Pons Sanz', 1350)]

In [ ]:
%sql select nombre, salario FROM empleado WHERE ( salario >= 1400 AND salario <= 1600 );

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Andres Riera Herrera', 1500),
 ('Saul Moreno Santos', 1600),
 ('Isaac Jimenez Ortiz', 1600),
 ('Guillermo Vidal Gomez', 1400),
 ('Daniel Quintero Quintero', 1500),
 ('Juan Manuel Olivares', 1500)]

In [ ]:
%sql select nombre, salario FROM empleado WHERE salario BETWEEN 1400 AND 1600;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Andres Riera Herrera', 1500),
 ('Saul Moreno Santos', 1600),
 ('Isaac Jimenez Ortiz', 1600),
 ('Guillermo Vidal Gomez', 1400),
 ('Daniel Quintero Quintero', 1500),
 ('Juan Manuel Olivares', 1500)]

In [ ]:
%sql select nombre, salario FROM empleado WHERE salario IN (1400,1600);

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Saul Moreno Santos', 1600),
 ('Isaac Jimenez Ortiz', 1600),
 ('Guillermo Vidal Gomez', 1400)]

### **Ejercicio 2**
----
Con el propósito actualizar la información de los clientes se quiere contactar a aquellos clientes que no tienen asociada una persona de contacto, para esto se pide que muestre de la tabla "cliente" los campos "nombre" y "telefono" de los clientes que no tienen un contacto registrado.

In [ ]:
%sql PRAGMA table_info(cliente)

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(0, 'cliente_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 1, None, 0),
 (4, 'contacto', 'TEXT', 0, None, 0),
 (5, 'telefono_contacto', 'TEXT', 0, None, 0),
 (6, 'ciudad', 'TEXT', 1, None, 0)]

In [ ]:
%sql select * from cliente

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

In [ ]:
%%sql
SELECT nombre,telefono

FROM cliente

WHERE contacto LIKE ''

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Arnau Medina Garcia', '094-10-88'),
 ('Jan Vargas Santana', '780-65-24'),
 ('Pol Moya Pena', '780-25-24')]

In [ ]:
%%sql
SELECT nombre,telefono

FROM cliente

WHERE LENGTH(contacto)=0

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Arnau Medina Garcia', '094-10-88'),
 ('Jan Vargas Santana', '780-65-24'),
 ('Pol Moya Pena', '780-25-24')]

### EL operador BETWEEN
Esta última instrucción puede escribirse de otra forma usando el operador **BETWEEN**, este operador es usado cuando queremos indicar que deseamos recuperar los registros según un intervalo de valores dado sobre un campo.

In [ ]:
%sql select nombre, salario FROM empleado WHERE salario Between 1400 AND 1600

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Andres Riera Herrera', 1500),
 ('Saul Moreno Santos', 1600),
 ('Isaac Jimenez Ortiz', 1600),
 ('Guillermo Vidal Gomez', 1400),
 ('Daniel Quintero Quintero', 1500),
 ('Juan Manuel Olivares', 1500)]

### EL operador LIKE
Este operador es usado cuando se filtra la consulta con algún modelo o patrón sobre una columna.
Este operador se combina con simbolos "%" y "_":
* % Representa cero o mas caracteres a ser reemplazados en el patron por otros.
* _ Representa un único caracter.

Veamos algúnos ejemplos:

In [ ]:
%sql select * FROM cliente WHERE nombre LIKE "%Garcia%";

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid')]

La instrucción anterior busca todos los clientes cuyo nombre contiene la secuencia de caracteres "Medina" en alguna posición.

In [ ]:
%sql select * FROM cliente WHERE email LIKE "%@gmail.com";

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

EL comando anterior busca los clientes que tienen un correo que termine en "@gmail.com".

**Veamos a consultar todos los clientes cuyo número telefónico comience por "780"**

In [ ]:
%sql select * FROM cliente WHERE telefono LIKE "780-%";

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo')]

### **Ejercicio 3**
--------
Un empleado de la empresa Love4Pets se dió cuenta que un cliente dejó por accidente su celular, el empleado recuerda que alguno de sus apellidos era "Leon".

Se quiere que determinar a quien pertenece el celular extraviado, y en caso de ser posible avisar a su persona de contacto que el celular está a salvo y pueden pasar buscandolo en cualquier momento.
   
Se sabe que la tabla **"cliente"** tiene un campo **"nombre"** el cual contiene nombres y apellidos, el campo **"contacto"** que tiene el nombre de la persona de contacto y el campo **"telefono_contacto"** que tiene el telefono de la persona de contacto.

In [ ]:
%sql PRAGMA table_info(cliente)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(0, 'cliente_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 1, None, 0),
 (4, 'contacto', 'TEXT', 0, None, 0),
 (5, 'telefono_contacto', 'TEXT', 0, None, 0),
 (6, 'ciudad', 'TEXT', 1, None, 0)]

In [ ]:
%%sql
SELECT nombre, contacto,telefono_contacto

FROM cliente

WHERE nombre LIKE '%LEON%'

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Rayan Leon Ferrer', 'Santiago Perez Ramos', '577-21-24')]

### Operadores AND, OR, NOT
Estos operadores son usados para filtrar resultados según mas de una condición.

**Operador AND:** Se muestran los resultados que cumplen las condiciones separadas por el operador AND, es decir el resultado de la operación AND tiene valor TRUE

Sintaxis del Operador AND
```sql
select campo FROM Tabla WHERE condicion1 AND condicion2;
```

**Operador OR:** Se muestran los resultados que cumplen alguna de las condiciones separadas por el operador OR, es decir el resultado de la operación OR tiene valor TRUE

Sintaxis del Operador OR
```sql
select campo FROM Tabla WHERE condicion1 OR condicion2;
```

**Operador NOT:** Se muestran los resultados que NO cumplen con la condicion indicada.

Sintaxis del Operador NOT
```sql
select campo FROM Tabla WHERE NOT condicion1;
```

In [ ]:
%sql select * FROM empleado WHERE (salario >= 1500 AND departamento_id = 6)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Andres Riera Herrera', 'andresr@gmail.com', '200-88-76', 1500, '2017-05-17 00:00:000', 6),
 (9, 'Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06', 1500, '2017-03-05 00:00:000', 6),
 (11, 'Miguel Soto', 'misoto@gmail.com', '269-92-06', 1900, '2017-03-05 00:00:000', 6),
 (12, 'Alejandro Fernandez', 'alefer@gmail.com', '119-91-16', 1850, '2017-03-05 00:00:000', 6)]

En el ejemplo anterior la consulta muestra los empleados que tienen un salario mayor o igual a 1500 y que trabajan en el departamento de informática el cual tiene código 6.

Veamos como podemos usar **consultas anidadas** para buscar la misma consulta colocando el nombre del departamento en lugar del código.

In [ ]:
%%sql
select * FROM empleado
WHERE
( salario >= 1500 AND departamento_id = (select departamento_id FROM departamento WHERE nombre="informatica" ) )

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Andres Riera Herrera', 'andresr@gmail.com', '200-88-76', 1500, '2017-05-17 00:00:000', 6),
 (9, 'Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06', 1500, '2017-03-05 00:00:000', 6),
 (11, 'Miguel Soto', 'misoto@gmail.com', '269-92-06', 1900, '2017-03-05 00:00:000', 6),
 (12, 'Alejandro Fernandez', 'alefer@gmail.com', '119-91-16', 1850, '2017-03-05 00:00:000', 6)]

Veamos un ejemplo donde consultamos las mascotas asociadas a una persona con nombre "Arnau Medina Garcia"

In [ ]:
%%sql
select * FROM mascota WHERE  cliente_id=( select cliente_id FROM cliente WHERE nombre="Arnau Medina Garcia" )

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(1, 'Luna', 2, 'gato', 'mestizo', '2009-01-01 00:00:000')]

Ejemplo con Operador **OR**

In [ ]:
%%sql
select nombre, departamento_id from empleado where (empleado.departamento_id = 1) OR (empleado.departamento_id = 3)

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Pablo Pons Sanz', 1),
 ('Saul Moreno Santos', 1),
 ('Isaac Jimenez Ortiz', 3),
 ('Guillermo Vidal Gomez', 3)]

En la consulta anterior se muestran los empleados que trabajan en el departamento de Finanzas o en el departamento de Recursos Humanos

Ejemplo con el operador **NOT**

Veamos el complemento de la consulta anterior.

In [ ]:
%%sql
select nombre, departamento_id from empleado
where
NOT ((empleado.departamento_id = 1) OR (empleado.departamento_id = 3))

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Andres Riera Herrera', 6),
 ('Lucas Serrano Caballero', 2),
 ('Nil Soler Diez', 5),
 ('Sergio Reyes Gallardo', 5),
 ('Daniel Quintero Quintero', 6),
 ('Miguel Soto', 6),
 ('Alejandro Fernandez', 6)]

### **Ejercicio 4**
--------
La empresa Love4Pets considera hacer un descuento sobre los productos que cuestan entre 10 y 20 euros, y complementos vitamínicos.
      
Se requiere que liste las columnas "nombre", "descripcion", "precio" de productos a los que debe ser aplicado el descuento. ( asuma que los productos se encuentran en la tabla "producto" )
   
Asuma que el producto vitaminico no lleva acentos, generalmente estos productos tienen la palabra vitamina en la **"descripcion"** pero podria ser alguna variante como vitaminico o comenzar por mayusculas, el departamento de informática recomendó usar la función Like para esta busqueda.

In [ ]:
%sql select * from producto

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Champu Mimadito', 'Champu neutro para mascotas', 7),
 (2, 'Vitaminas', 'Complemento vitaminico', 5),
 (3, 'Antipulgas', 'Liquido antipulgas', 3),
 (4, 'Perrarina', 'Huesos', 12),
 (5, 'Gatarina', 'Catspettito', 13),
 (6, 'Peine N7', 'Peine para perros numero 7', 3),
 (7, 'peluqueria', 'Corte de cabello para perros', 3),
 (8, 'Consulta', 'Consulta veterinaria', 15)]

In [ ]:
%sql PRAGMA table_info(producto)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(0, 'producto_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'descripcion', 'TEXT', 1, None, 0),
 (3, 'precio', 'INTEGER', 1, None, 0)]

In [ ]:
%%sql
SELECT nombre, descripcion, precio

FROM producto

WHERE (precio BETWEEN 10 AND 20) OR (lower(descripcion) LIKE '%com%vitam%')

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Vitaminas', 'Complemento vitaminico', 5),
 ('Perrarina', 'Huesos', 12),
 ('Gatarina', 'Catspettito', 13),
 ('Consulta', 'Consulta veterinaria', 15)]

### Funciones MAX() y MIN()
Con frecuencia tenemos una lista de valores y queremos obtener el mayor o el menor, esto es lo que hacen las funciones Max y Min.

Sintaxis de la función MIN
```sql
SELECT MIN(column_name)
FROM table_name
WHERE condition;
```

Sintaxis de la función MAX
```sql
SELECT MAX(column_name)
FROM table_name
WHERE condition;
```
Veamos un ejemplo:

In [ ]:
%sql select MIN(precio),nombre from producto;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(3, 'Antipulgas')]

In [ ]:
%sql select MAX(precio) from producto;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(15,)]

### **Ejercicio 5**
--------
La empresa Love4Pets esta considerando realizar un aumento.
    
Se requiere que indique cual es el menor sueldo que está pagando la empresa.

In [ ]:
%sql select * from empleado

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Andres Riera Herrera', 'andresr@gmail.com', '200-88-76', 1500, '2017-05-17 00:00:000', 6),
 (2, 'Lucas Serrano Caballero', 'lucas99@gmail.com', '115-24-36', 1200, '2018-05-17 00:00:000', 2),
 (3, 'Pablo Pons Sanz', 'ppsanz@gmail.com', '748-72-75', 1350, '2016-07-01 00:00:000', 1),
 (4, 'Saul Moreno Santos', 'saul.morenosantos@gmail.com', '346-87-27', 1600, '2016-07-01 00:00:000', 1),
 (5, 'Nil Soler Diez', 'nilsoler@gmail.com', '576-84-28', 1100, '2016-04-03 00:00:000', 5),
 (6, 'Sergio Reyes Gallardo', 'zerg@gmail.com', '598-95-67', 1000, '2016-04-03 00:00:000', 5),
 (7, 'Isaac Jimenez Ortiz', 'isaacortiz@gmail.com', '370-19-65', 1600, '2016-07-08 00:00:000', 3),
 (8, 'Guillermo Vidal Gomez', 'guillevidal@gmail.com', '099-05-68', 1400, '2016-01-03 00:00:000', 3),
 (9, 'Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06', 1500, '2017-03-05 00:00:000', 6),
 (10, 'Juan Manuel Olivares', 'juanma@gmail.com', '269-37-06', 1500, '2017-03-05 00:00:000', None),
 (11, 'Miguel Soto', 'misoto@gmail.com', '269-92-06', 1900, '2017-03-05 00:00:000', 6),
 (12, 'Alejandro Fernandez', 'alefer@gmail.com', '119-91-16', 1850, '2017-03-05 00:00:000', 6)]

In [ ]:
%sql select MIN(salario) from empleado

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1000,)]

### Funciones COUNT(), AVG(), SUM()
Nos permite contar la cantidad de resultados que arroja una consulta, obtener un valor promedio, o sumar los valores de una consulta.

**Función count** Retorna la cantidad de filas que arroja una consulta.

Sintaxis de la función COUNT
```sql
SELECT COUNT(column_name)
FROM table_name
WHERE condition;
```

**Función AVG** Retorna la el promedio de los valores de las filas que arroja una consulta.

Sintaxis de la función COUNT
```sql
SELECT AVG(column_name)
FROM table_name
WHERE condition;
```

**Función SUM** Retorna la el promedio de los valores de las filas que arroja una consulta.

Sintaxis de la función COUNT
```sql
SELECT SUM(column_name)
FROM table_name
WHERE condition;
```

In [ ]:
%sql select COUNT(salario) from empleado;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(12,)]

### **Ejercicio 6**
--------
La empresa Love4Pets continúa estudiando un ajuste en los salarios de los empleados, por lo que se quiere conocer el presupuesto total requerido para el pago de los salarios en un año.

In [ ]:
%%sql
SELECT SUM(salario)*12
FROM empleado

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(210000,)]

### El Operador IN
Permite especificar multiples valores a la clausula WHERE

Sintaxis del operador IN
```sql
SELECT column_name(s)
FROM table_name
WHERE column_name IN (value1, value2, ...);
```
Veamos un ejemplo

In [ ]:
%sql select nombre, ciudad from cliente where ciudad IN ("Madrid", "Toledo");

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Mario Flores Gallardo', 'Madrid'),
 ('Arnau Medina Garcia', 'Madrid'),
 ('Ivan Medina Rubio', 'Toledo'),
 ('Jan Vargas Santana', 'Madrid'),
 ('Carlos Costa Guerrero', 'Madrid'),
 ('Roberto Martin Ortega', 'Madrid'),
 ('Gabriel Gonzalez Ortega', 'Madrid'),
 ('Rayan Leon Ferrer', 'Madrid'),
 ('Aitor Ruiz Sanchez', 'Madrid'),
 ('Eric Rubio Carrasco', 'Madrid'),
 ('Alberto Sanz Ruiz', 'Madrid'),
 ('Jesus Medina Hernandez', 'Madrid'),
 ('Pol Moya Pena', 'Toledo'),
 ('Jose Gallardo Rodriguez', 'Madrid'),
 ('Manuel Angel Gil', 'Madrid')]

### Clausula JOIN

Hasta ahora hemos realizado consultas muy sencillas casi todas sobre una sola tabla, sin aprovechar las relaciones que existen entre las tablas.

Algunas de las tablas en Love4Pets están relacionadas  por medio de claves foraneas, por ejemplo la tabla empleado tiene un campo departamento_id que almacena el código del departamento donde trabaja un empleado, por medio de está relación podemos consultar también el nombre del departamento, esta consulta puede hacerse haciendo consultas anidadas, pero también usando la clausula **JOIN**

La clausula JOIN es usada para combinar columnas de una o mas tablas por medio de campos que relacionan estas tablas.

Existen diferentes tipos de JOIN.

#### **Inner JOIN**
Retorna los valores cumplen la relación entre ambas tablas, es decir las filas de una tabla que estan relacionadas con filas de otra tabla por medio de claves foraneas. El INNER JOIN también es llamado simplemente JOIN.

Sintaxis del Inner Join

```sql
select campo1, campo2, campoN FROM tabla1 INNER JOIN tabla2 ON tabla1.campo = tabla2.campo;
```

Veamos un ejemplo:  
Primero veamos la siguiente consulta

In [ ]:
%%sql
SELECT empleado.nombre, departamento.nombre

FROM empleado, departamento

WHERE empleado.departamento_id = departamento.departamento_id;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Andres Riera Herrera', 'informatica'),
 ('Lucas Serrano Caballero', 'ventas'),
 ('Pablo Pons Sanz', 'finanzas'),
 ('Saul Moreno Santos', 'finanzas'),
 ('Nil Soler Diez', 'veterinario'),
 ('Sergio Reyes Gallardo', 'veterinario'),
 ('Isaac Jimenez Ortiz', 'recursos humanos'),
 ('Guillermo Vidal Gomez', 'recursos humanos'),
 ('Daniel Quintero Quintero', 'informatica'),
 ('Miguel Soto', 'informatica'),
 ('Alejandro Fernandez', 'informatica')]

Se muestran todos los empleados que trabajan en algun departamento, en esta consulta se excluyen empleados que no trabajan en ningun departamento y departamentos que no tienen ningun empleado.

Veamos ahora la siguiente consulta

In [ ]:
%%sql
select empleado.nombre AS 'NombreEmp', departamento.nombre 'NombreDep'

from empleado INNER JOIN departamento ON empleado.departamento_id = departamento.departamento_id

WHERE empleado.salario > 1800

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Miguel Soto', 'informatica'), ('Alejandro Fernandez', 'informatica')]

Esta instrucción realiza la misma consulta que el comando anterior, es decir muestra los empleados que trabajan en algun departamento

#### **Left JOIN**
Retorna los registros de la tabla "izquierda" o la primera tabla, y los registros que coinciden con la segunda tabla, excluyendo los registros que se encuentren en la segunda tabla pero que no hagan match con la primera.
![Texto alternativo](https://raw.githubusercontent.com/dasesu/practicasql/master/imagenes/left%20join.png)

Sintaxis del LEFT JOIN
```sql
select campo1, campo2, campoN FROM tabla1 LEFT JOIN tabla2 ON tabla1.campo = tabla2.campo;
```

Veamos un ejemplo:

In [ ]:
%%sql
select empleado.nombre, departamento.nombre from empleado
LEFT JOIN
departamento ON empleado.departamento_id = departamento.departamento_id;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Andres Riera Herrera', 'informatica'),
 ('Lucas Serrano Caballero', 'ventas'),
 ('Pablo Pons Sanz', 'finanzas'),
 ('Saul Moreno Santos', 'finanzas'),
 ('Nil Soler Diez', 'veterinario'),
 ('Sergio Reyes Gallardo', 'veterinario'),
 ('Isaac Jimenez Ortiz', 'recursos humanos'),
 ('Guillermo Vidal Gomez', 'recursos humanos'),
 ('Daniel Quintero Quintero', 'informatica'),
 ('Juan Manuel Olivares', None),
 ('Miguel Soto', 'informatica'),
 ('Alejandro Fernandez', 'informatica')]

En el resultado anterior observe que el empleado "Juan Manuel Olivares" no está asociado a ningun departamento, sin embargo este es mostrado porque forma parte de la tabla1, pero no en la tabla2

#### **Right JOIN**
Retorna los registros de la tabla "derecha" o la segunda tabla, y los registros que coinciden con la primera tabla, excluyendo los registros que se encuentren en la primera tabla pero que no hagan match con la segunda.

Sintaxis del RIGHT JOIN
```sql
select campo1, campo2, campoN FROM tabla1 RIGHT JOIN tabla2 ON tabla1.campo = tabla2.campo;
```

**Esta instrucción no es reconocida por Sqlite3, por lo que al tratar de ejecutar esta sentencia se obtendrá un error.**

Sin embargo esta instrucción puede construirse usando un LEFT JOIN invirtiendo el orden de las tablas.

Veamos un ejemplo. ( El siguiente es un error provocado de forma intencional )

In [ ]:
%%sql
select empleado.nombre, departamento.nombre from empleado
RIGHT JOIN
departamento ON empleado.departamento_id = departamento.departamento_id;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: select empleado.nombre, departamento.nombre from empleado
RIGHT JOIN
departamento ON empleado.departamento_id = departamento.departamento_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

El siguiente código arroja el mismo resultado que debería arrojar el RIGHT JOIN, haciendo uso del LEFT JOIN, invirtiendo las la posición de las tablas

In [ ]:
%%sql
select departamento.nombre, empleado.nombre from departamento
LEFT JOIN
empleado ON empleado.departamento_id = departamento.departamento_id;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('finanzas', 'Pablo Pons Sanz'),
 ('finanzas', 'Saul Moreno Santos'),
 ('ventas', 'Lucas Serrano Caballero'),
 ('recursos humanos', 'Guillermo Vidal Gomez'),
 ('recursos humanos', 'Isaac Jimenez Ortiz'),
 ('marketing', None),
 ('veterinario', 'Nil Soler Diez'),
 ('veterinario', 'Sergio Reyes Gallardo'),
 ('informatica', 'Alejandro Fernandez'),
 ('informatica', 'Andres Riera Herrera'),
 ('informatica', 'Daniel Quintero Quintero'),
 ('informatica', 'Miguel Soto'),
 ('investigacion', None)]

### **Ejercicio 7**
--------
 Considerando la tabla "cliente" y la tabla "mascota" las cuales tienen una relación uno a muchos.  
 Indique los clientes que no tienen mascota registrada.

In [ ]:
%sql select * from cliente

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

In [ ]:
%sql select * from mascota

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(1, 'Luna', 2, 'gato', 'mestizo', '2009-01-01 00:00:000'),
 (2, 'Sole', 3, 'gato', 'mestizo', '2010-02-01 00:00:000'),
 (3, 'Mida', 3, 'perro', 'Caint terrier', '2007-02-03 00:00:000'),
 (4, 'Tara', 5, 'perro', 'Puddle', '2006-02-03 00:00:000'),
 (5, 'Pelusa', 6, 'perro', 'Puddle', '2008-02-03 00:00:000'),
 (6, 'irene', 7, 'gato', 'siames', '2015-02-03 00:00:000'),
 (7, 'sara', 8, 'gato', 'mestizo', '2016-05-01 00:00:000'),
 (8, 'milo', 11, 'gato', 'mestizo', '2016-09-01 00:00:000'),
 (9, 'oliver', 11, 'gato', 'mestizo', '2016-07-07 00:00:000'),
 (10, 'Duke', 14, 'perro', 'Pastor Aleman', '2011-05-03 00:00:000')]

In [ ]:
%%sql
SELECT cliente.cliente_id, cliente.nombre

FROM cliente

WHERE cliente.cliente_id NOT IN (SELECT cliente_id FROM mascota)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Mario Flores Gallardo'),
 (4, 'Jan Vargas Santana'),
 (9, 'Aitor Ruiz Sanchez'),
 (10, 'Eric Rubio Carrasco'),
 (12, 'Jesus Medina Hernandez'),
 (13, 'Pol Moya Pena'),
 (15, 'Manuel Angel Gil')]

In [ ]:
%%sql
SELECT cliente.cliente_id, cliente.nombre, mascota.mascota_id

FROM cliente LEFT JOIN mascota ON cliente.cliente_id = mascota.cliente_id

WHERE mascota.mascota_id IS NULL

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', None),
 (4, 'Jan Vargas Santana', None),
 (9, 'Aitor Ruiz Sanchez', None),
 (10, 'Eric Rubio Carrasco', None),
 (12, 'Jesus Medina Hernandez', None),
 (13, 'Pol Moya Pena', None),
 (15, 'Manuel Angel Gil', None)]

### Operador UNION
Es usado para combinar resultados de varias consultas en una sola vista.
* Cada Instrucción SELECT involucrada en la operación UNION tiene que tener la misma cantidad de columnas.
* Las columnas ademas tienen que tener los mismos tipos de datos.

**Sintaxis de la Operación UNION**
```sql
SELECT column_name(s) FROM table1
UNION
SELECT column_name(s) FROM table2;
```

In [ ]:
%%sql
select nombre,email,telefono from empleado
UNION
select nombre,email,telefono from cliente

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24'),
 ('Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24'),
 ('Alejandro Fernandez', 'alefer@gmail.com', '119-91-16'),
 ('Andres Riera Herrera', 'andresr@gmail.com', '200-88-76'),
 ('Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88'),
 ('Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24'),
 ('Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06'),
 ('Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79'),
 ('Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14'),
 ('Guillermo Vidal Gomez', 'guillevidal@gmail.com', '099-05-68'),
 ('Isaac Jimenez Ortiz', 'isaacortiz@gmail.com', '370-19-65'),
 ('Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72'),
 ('Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24'),
 ('Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25'),
 ('Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11'),
 ('Juan Manuel Olivares', 'juanma@gmail.com', '269-37-06'),
 ('Lucas Serrano Caballero', 'lucas99@gmail.com', '115-24-36'),
 ('Manuel Angel Gil', 'manano@gmail.com', '733-65-16'),
 ('Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36'),
 ('Miguel Soto', 'misoto@gmail.com', '269-92-06'),
 ('Nil Soler Diez', 'nilsoler@gmail.com', '576-84-28'),
 ('Pablo Pons Sanz', 'ppsanz@gmail.com', '748-72-75'),
 ('Pol Moya Pena', 'polmoya@gmail.com', '780-25-24'),
 ('Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24'),
 ('Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27'),
 ('Saul Moreno Santos', 'saul.morenosantos@gmail.com', '346-87-27'),
 ('Sergio Reyes Gallardo', 'zerg@gmail.com', '598-95-67')]

### La Instrucción GROUP BY
Permite agrupar valores por un valor común a ellos

Sintaxis de la instrucción GROUP BY
```sql
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
```

Veamos un ejemplo contamos la cantidad de clientes que habitan en cada ciudad.

In [ ]:
%%sql
select COUNT(nombre),ciudad from cliente
GROUP BY ciudad

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(13, 'Madrid'), (2, 'Toledo')]

### **Ejercicio 8**
--------
No todas las personas tienen la misma cantidad de mascotas. Se requiere que usted indique el cliente y cantidad de mascotas que tiene cada cliente que tenga mascotas.

In [ ]:
%sql select * from cliente

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

In [ ]:
%sql select * from mascota

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Luna', 2, 'gato', 'mestizo', '2009-01-01 00:00:000'),
 (2, 'Sole', 3, 'gato', 'mestizo', '2010-02-01 00:00:000'),
 (3, 'Mida', 3, 'perro', 'Caint terrier', '2007-02-03 00:00:000'),
 (4, 'Tara', 5, 'perro', 'Puddle', '2006-02-03 00:00:000'),
 (5, 'Pelusa', 6, 'perro', 'Puddle', '2008-02-03 00:00:000'),
 (6, 'irene', 7, 'gato', 'siames', '2015-02-03 00:00:000'),
 (7, 'sara', 8, 'gato', 'mestizo', '2016-05-01 00:00:000'),
 (8, 'milo', 11, 'gato', 'mestizo', '2016-09-01 00:00:000'),
 (9, 'oliver', 11, 'gato', 'mestizo', '2016-07-07 00:00:000'),
 (10, 'Duke', 14, 'perro', 'Pastor Aleman', '2011-05-03 00:00:000')]

In [ ]:
%%sql
SELECT cliente.nombre, COUNT(cliente.nombre) AS 'Cantidad Mascotas'

FROM cliente INNER JOIN mascota ON cliente.cliente_id = mascota.cliente_id

GROUP BY mascota.cliente_id

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Arnau Medina Garcia', 1),
 ('Ivan Medina Rubio', 2),
 ('Carlos Costa Guerrero', 1),
 ('Roberto Martin Ortega', 1),
 ('Gabriel Gonzalez Ortega', 1),
 ('Rayan Leon Ferrer', 1),
 ('Alberto Sanz Ruiz', 2),
 ('Jose Gallardo Rodriguez', 1)]

### La Instrucción HAVING
Permite filtrar una busqueda donde se aplica una función de agregación sobre la condición.

Sintaxis de la instrucción GROUP BY
```sql
SELECT column_name(s)
FROM table_name
WHERE condition
HAVING column_name(s)
```

Tomando el mismo ejemplo anterior queremos mostrar las ciudades que tengan mas de 5 clientes.

In [ ]:
%%sql
select COUNT(nombre),ciudad from cliente
GROUP BY ciudad HAVING COUNT(nombre) > 1;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(13, 'Madrid'), (2, 'Toledo')]

### **Ejercicio 9**
--------
Se requiere que usted indique los clientes que tienen mas de una mascota.

In [ ]:
%%sql
SELECT cliente.nombre, COUNT(cliente.nombre) AS 'Cantidad Mascotas'

FROM cliente INNER JOIN mascota ON cliente.cliente_id = mascota.cliente_id

GROUP BY mascota.cliente_id HAVING COUNT(cliente.nombre) > 1

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Ivan Medina Rubio', 2), ('Alberto Sanz Ruiz', 2)]

### La Instrucción INSERT
La instrucción insert permite agregar nuevos valores a las tablas

```sql
INSERT INTO table_name (columna1, columna2, columna3, ...)
VALUES (valor1, valor2, valor3, ...);
```

donde el valor1 es insertado en la columna1, el valor2 en la columna2 y asi sucesivamente.

In [ ]:
%sql PRAGMA table_info(departamento)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(0, 'departamento_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0)]

In [ ]:
%sql select * from departamento

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'finanzas'),
 (2, 'ventas'),
 (3, 'recursos humanos'),
 (4, 'marketing'),
 (5, 'veterinario'),
 (6, 'informatica'),
 (7, 'investigacion'),
 (8, 'ciber')]

In [ ]:
%%sql
INSERT INTO departamento (departamento_id,nombre)
VALUES (9,898)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
1 rows affected.

[]

In [ ]:
%sql select * from departamento

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'finanzas'),
 (2, 'ventas'),
 (3, 'recursos humanos'),
 (4, 'marketing'),
 (5, 'veterinario'),
 (6, 'informatica'),
 (7, 'investigacion'),
 (8, 'ciber'),
 (9, '898')]

### La Instrucción DELETE
La instrucción DELETE permite ELIMINAR filas que cumplan con una determinada condición

```sql
DELETE FROM table_name
WHERE condition;
```

In [ ]:
%sql delete from departamento where nombre='898';

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
1 rows affected.

[]

## UPDATE

In [ ]:
%%sql
UPDATE departamento
SET nombre = 'vet'
WHERE nombre LIKE "%veterinario%"

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
1 rows affected.

[]

In [ ]:
%sql SELECT * from departamento

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'finanzas'),
 (2, 'ventas'),
 (3, 'recursos humanos'),
 (4, 'marketing'),
 (5, 'vet'),
 (6, 'informatica'),
 (7, 'investigacion')]